[
    "Incorrect behavior :- suggested change is rejected due to implementation mismatch.",
    "Abandoned:  Deviceless AOT functionality already working.",
    "Stalled :- discussion did not converge on resolution.",
    "Upstream bug fixed in dependency.",
    "Inconsistent behavior change, deprecates existing functionality unnecessarily.",
    "Superseded by another PR.",
    "Test failed on GPU.  PR reverted due to incompatibility with GPU.",
    "Inconsistent behavior change deemed unnecessary and potentially harmful to users.",
    "Implemented Incorrectly :- PR implemented differently than suggested by reviewer.",
    "Inconsistent :- PR tries to enforce NumPy behavior but JAX is a superset of NumPy.",
    "Intended Behavior Change: PR closed as it broke core abstraction and existing behavior.",
    "Author misunderstands :- PR tries to deprecate functionality deemed useful by maintainers.",
    "Reduced tests for `jax.nn.dot_product_attention`.",
    "Superseded :- jax's functionality is a superset of numpy.",
    "Superseded by another PR.",
    "Code Quality :- PR closed due to inconsistent implementation.",
    "Code Functionality :- PR closed as it was deemed unnecessary to restrict functionality.",
    "Closed as not useful.",
    "Inconclusive :- PR closed after discussion about complex inputs.",
    "PR closed as it deprecates supported functionality without significant benefit.",
    "Inconclusive :- PR closed due to disagreement between author and reviewer about functionality.",
    "Implemented :- PR closed as the change was implemented internally.",
    "Inconclusive :- PR closed after discussion on complex inputs and consistency with numpy.",
    "Incorrect behavior :- PR tried to match numpy but JAX should supersede it.",
    "Superseded by other changes :- superseded by another PR that fixed the dependency.",
    "Closed as infeasible/incorrect: PR did not add value or implemented the wrong solution.",
    "Deprecated behavior restored.",
    "Build issues fixed before merge.",
    "Closed as superseded/redundant/erroneous/outdated by other work.",
    "Improved :- PR improved documentation/clarity.",
    "Superseded by another approach\nIssue resolved without PR\nMiscommunication with reviewer\nBugfix superseded by dependency update\nFunctionality deprecation",
    "Intended behavior change was deemed unnecessary after discussion with collaborators.",
    "Merged :- PR was merged after requested changes were made.",
    "Closed as not useful: the PR was deemed not valuable and potentially harmful (exposing internals or breaking existing use cases).",
    "Inconsistent behavior deprecated existing functionality.",
    "Author no longer interested, closed as not useful.",
    "Closed as wontfix: PR deemed unnecessary/incompatible.",
    "Inconsistent behavior with NumPy resolved.  Functionality retained in JAX.  PR closed as unnecessary.",
    "Unnecessary: PR functionality deemed unnecessary due to broader JAX design principles.",
    "Merged as part of another PR.",
    "Inconclusive/Inconsistent :- PR deemed unnecessary after discussion; jax superset of numpy.",
    "Inconsistent behavior change, deprecated existing functionality.",
    "Closed as not useful/out of scope.",
    "Superseded by another PR :- Closed in favor of another PR.",
    "Functionality mismatch fixed by alternative solution.",
    "Closed as outdated/redundant/erroneous/miscommunication.",
    "Author withdrew PR :- Author decided to abandon the PR.",
    "Functionality change rejected due to incompatibility with numpy and potential breakage of existing user code.",
    "Here's a 10-word summary for each PR closure reason:\n\n**PR 15347:** Replaced by another PR addressing sharded array issues.\n\n**PR 25802:**  Incorrect approach; solution documented elsewhere; closed.\n\n**PR 25143:**  Abandoned; functionality already working without changes.\n\n**PR 25107:** Closed due to misunderstanding of requested changes.\n\n**PR 24438:** Workaround obsolete after dependency update fixed bug.\n\n**PR 24203:** Closed as deprecation deemed unnecessary and harmful.",
    "Improper behavior change, corrected by contributor.",
    "PR closed as unnecessary: behavior considered valid and useful.",
    "PR closed as unnecessary because JAX supersedes NumPy functionality.",
    "Inconclusive :- PR closed due to differing opinions on approach.",
    "PR closed as the proposed change was deemed unnecessary and potentially harmful to existing users.",
    "Inconsistent behavior deprecated existing functionality.",
    "Superseded by another PR/implementation.",
    "Incorrect behavior :- PR tries to match NumPy behavior but JAX behavior is correct.",
    "Upstream changes supersede patch.",
    "CLA issue, the PR was closed without merging because the author didn't sign the CLA.",
    "Closed as not useful/inconsistent with project goals.",
    "Superseded by other PR/fix.",
    "Inconsistent behavior change; performance regression; underlying bug fixed; author misunderstanding; deprecated functionality.",
    "Merged :- Code changes integrated after review.",
    "Stale; Author misunderstood; Redundant; Outdated; Erroneous.",
    "Superseded by other work: the FFI is now available.",
    "Incorrect :- PR implementation is inconsistent with numpy but has valid use cases.",
    "Superseded by XLA FFI API.",
    "Bugfix reverted due to dependency update.",
    "Inconsistent behavior change; deprecated useful functionality.",
    "Inconsistent behavior change, deemed unnecessary and potentially harmful.",
    "JEP implemented via plugin architecture.",
    "PR '11475' was closed because a **better implementation** was provided in a different PR ('12683').",
    "Incorrect behavior :- PR tries to deprecate a feature that is numerically valid and in fact more accurate in certain conditions despite NumPy not supporting it.",
    "Functionality :- PR adds new features or improves existing ones.",
    "Functionality implemented elsewhere, inaccurate, outdated, redundant, erroneous, miscommunication, testing overhead, incompatible with JIT, broken tests, insufficient testing.",
    "Inconsistent behavior change, deemed unnecessary and potentially harmful.",
    "Improved Performance/Compatibility:- gathers/scatters expanded to slices for jax2tf compatibility and potential performance gains on certain backends when enable_xla=False.",
    "Closed as not useful.  The PR deprecated supported functionality, unnecessarily matching NumPy limitations.  The JAX implementation returned reasonable results for complex inputs, and JAX generally aims for broader support than NumPy.",
    "Inconclusive :- PR closed without a clear reason. Though comments suggest added complexity wasn't worth minor performance gain.",
    "Unnecessary :- PR attempted to enforce NumPy behavior where JAX supersedes it.",
    "Inconsistent behavior :- PR aimed for NumPy consistency but JAX prefers to offer broader functionality.",
    "Inconclusive :- PR closed due to lack of consensus on design and implementation.",
    "PR 10228: **Code Complexity/Maintainability**. The proposed simplification, while improving performance in some areas, increased code complexity and was deemed not worth the trade-off after further review.\n\nPR 25802: **Erroneous/Misuse**. The PR attempted to improve an error message but was closed because it exposed internal APIs and represented a misuse of the `custom_partitioning` feature.\n\nPR 25143: **Redundant/Obsolete**. The PR was abandoned because the underlying issue was already resolved by other changes, making this PR unnecessary.\n\nPR 25107: **Miscommunication/Implementation**. The PR was closed due to a misunderstanding between the author and reviewers regarding the desired implementation of config updates.\n\nPR 24438: **Outdated/Bug Fix**. The PR addressed a compiler bug that was subsequently fixed in a later release of the CUDA toolkit.\n\nPR 24203: **Erroneous/Compatibility**. The PR aimed to align JAX behavior with NumPy by disallowing complex inputs, but was closed because it would break existing JAX code without sufficient justification.",
    "Stale :- PR went stale due to inactivity.",
    "Superseded :- PR closed in favor of another approach.",
    "Stale :- PR closed due to inactivity or outdated.\nRedundant :- PR became unnecessary.\nMiscommunication :- Author misunderstood requested changes.\nOutdated :- PR addressed bug fixed upstream.\nErroneous :- PR incorrect or added no value.",
    "Closed as not useful/erroneous.  PR sought to remove complex dtype support to match numpy, but JAX prefers to be a superset of numpy's functionality.  Removing support is considered undesirable.",
    "Licensing issues, insufficient clarity, contributor license agreement failure, erroneous changes, resolved dependency bug, outdated code, superseded by another PR, and redundant changes.",
    "Inconclusive :- PR closed without a clear reason stated by the author.",
    "Superseded by other changes: The PR was closed because a related change elsewhere made it unnecessary.",
    "Inconsistent behavior: PR attempts to remove complex dtype support, breaking existing users.",
    "Inconsistent behavior fixed: PR closed as the change was deemed unnecessary.  JAX functionality supersedes NumPy, so matching NumPy error behavior not needed.",
    "Inconclusive :- PR closed without clear explanation of why.  Though discussion suggests the desired outcome is achievable another way, the closing comment doesn't confirm this.",
    "Implemented :- PR addressed discrepancy between jax and numpy.",
    "Superseded, Redundant, Miscommunication, Outdated, Erroneous",
    "Inconclusive :- PR subsumed by other work which generalized the effects tracking.",
    "Implemented :- PR closed after addressing all review comments and being merged.",
    "Implemented elsewhere :- PR implemented as a separate library.",
    "Implementation mismatch with NumPy resolved by keeping JAX implementation and improving documentation.",
    "Inconsistent behavior with NumPy rectified.",
    "Closed as not useful; the proposed change was rejected.",
    "fixed in an internal changelist",
    "Superseded :- PR became irrelevant due to dependency update.",
    "Superseded :- PR became unnecessary after further discussion.",
    "Closed as not useful/incorrect :- PR intends to make jax compatible with numpy, which is deemed not useful.",
    "Superseded :- Prototype implementation superseded by a real implementation.",
    "Functionality change was deemed unnecessary.",
    "IREE integration replaced this approach.",
    "Superseded by other changes :- PR closed as the implemented changes are not needed.",
    "Subsumed by other work.",
    "Inconsistent behavior change, deprecated existing implementation.",
    "Closed as not useful.  PR implemented a breaking change that was deemed undesirable.",
    "Inconsistent behavior change, closed as it deprecates existing implementation.",
    "Improved error message, code refactoring, abandoned due to existing solution, miscommunication with reviewer, bug fix in dependency, erroneous deprecation.",
    "Bug fix rejected due to better alternative.",
    "Intended Behavior Change :- PR closed as the change was deemed unnecessary or undesirable.",
    "Alternative implementation is not necessary, superseded by other work.",
    "Incompatible behavior change.",
    "Superseded :- PR changes are deemed unnecessary.",
    "Duplicate functionality :- PR tries to match numpy functionality, but Jax is a superset of numpy.",
    "Alternative implementation desired. PR closed in favor of a better approach.",
    "Code quality/correctness: PR closed due to incorrect implementation, code quality concerns, or incompatibility with project goals.\nOutdated: PR addressed an issue that has become irrelevant due to subsequent changes or dependency updates.\nRedundant: PR attempted to fix a problem that was already addressed or is not actually a problem.\nMiscommunication: PR closed due to misunderstandings between author and reviewer regarding desired changes.\nErroneous: PR introduced incorrect behavior or proposed changes that are not beneficial to the project.",
    "PR closed due to breaking semantics of scatter.",
    "Closed as erroneous; breaks existing functionality.",
    "Superseded by other functionality :- JAX functionality is a superset of numpy functionality and should not restrict itself based on numpy limitations.  The PR attempted to remove complex dtype support to match NumPy, but this was deemed unnecessary.",
    "PR closed as changes deemed unnecessary or incorrect.",
    "Superfluous: generalized version landed as jax.experimental.checkify.",
    "Inconsistent behavior change, closed as it would break existing users and deprecate useful functionality.",
    "Superseded by another PR/duplicate.",
    "Implemented :- PR implemented the proposed changes and addressed the comments.",
    "Stale/Inactive\nRedundant\nMiscommunication\nOutdated\nErroneous\nErroneous\nErroneous\nMiscommunication\nErroneous\nErroneous",
    "Merged as duplicate :- PR was superseded by another PR which addressed the same issue.",
    "Inconsistent behavior deprecated existing functionality.",
    "Incorrect behavior: PR tried to remove support for complex dtypes.",
    "Closed as not useful: PR deprecates useful functionality.",
    "Closed as superseded by another PR/fix.",
    "Closed as not useful.",
    "Replaced by another PR.",
    "Inconsistent behavior with NumPy; deprecates existing functionality.",
    "Superseded by other changes.",
    "Stale :- PR closed due to inactivity or outdated.",
    "Incompatible change breaking existing functionality.",
    "Improved implementation exists, implemented workaround for a bug which has since been fixed upstream, closing due to miscommunication, closing due to implementation already exists, not useful and potentially harmful.",
    "Rejected after discussion; JAX prefers superset of NumPy functionality.",
    "Fixes closure issues with custom_jvp/vjp and nondiff_argnums, enabling closure over Tracers.",
    "Abandoned :- PR closed as it would break existing users and not be consistent with JAX's goal of supersetting NumPy functionality.",
    "PR closed as it deprecates existing functionality without sufficient benefit.",
    "Superseded :- JAX features are a superset of NumPy, so there is no need to deprecate the complex dtype support.",
    "Here's a 10-word summary for each closure reason:\n\n* **PR 3821:** Superseded by another PR (#8043) addressing the same issue.\n* **PR 25802:**  Incorrect approach; solution documented elsewhere; closed by author.\n* **PR 25143:** Abandoned; deviceless AOT works without this change.\n* **PR 24438:** Obsolete; CUDA update fixed the underlying bug.\n* **PR 24203:**  Withdrawn; deprecating complex dtype support undesirable.",
    "Functionality mismatch: PR closed as it removes existing support for complex dtypes.",
    "Implementation mismatch with dependency :- PR tried to remove complex dtype support to match numpy but jax's implementation was deemed valuable and consistent with its dependency (stablehlo).",
    "Here's a breakdown of the reasons for closure based on your examples:\n\n* **Rejected/Erroneous:** The PR was fundamentally flawed, introduced regressions, or conflicted with project goals.  This covers cases where the PR was outright wrong, added unnecessary complexity, or exposed internal APIs.\n* **Redundant/Outdated:** The PR addressed an issue that had already been resolved or become irrelevant due to other changes, like a dependency update or a different PR addressing the same problem.\n* **Miscommunication/Unclear:** There was a lack of understanding between the author and reviewers, leading to confusion about the desired implementation or the PR's purpose. This can also include cases where the author didn't address reviewer feedback correctly.",
    "Closed as the PR deprecates a working feature and breaks compatibility with numpy needlessly.",
    "Superseded by other changes :- Issue addressed by a different implementation or fix.",
    "Closed as unnecessary; JAX implementation correct, NumPy's was lacking.",
    "Closed as not useful/needed: PR functionality already exists/PR deemed unnecessary after further discussion.",
    "Here's a 10-word summary for each closure reason, aiming for general applicability:\n\n* **Closure 1:** Inconsistent behavior fixed by later dependency update.\n* **Closure 2:** Functionality already present; PR abandoned.\n* **Closure 3:**  Misunderstanding of requested changes led to closure.\n* **Closure 4:** Bug workaround; obsolete after dependency fix. \n* **Closure 5:**  Functionality deemed valuable; PR rejected.",
    "Intended Behavior Change :- PR closed as the proposed change was deemed unnecessary or undesirable.",
    "Implemented :- PR was merged and closed by a collaborator.",
    "Closed as wontfix/invalid: the proposed change was rejected because it would reduce functionality or was deemed unnecessary.",
    "Superseded by community consensus to maintain existing functionality.",
    "Deprecated functionality.",
    "Closed as outdated, redundant, erroneous, or due to miscommunication.",
    "Stale :- PR became irrelevant due to external factors.",
    "Inconsistent behavior change; breaks existing user code without clear benefit.",
    "Stale/Inactive",
    "Inconclusive/Disagreement :- PR closed due to disagreement with suggested changes.",
    "Abandoned :- PR closed due to lack of activity/response.",
    "Stale :- No activity for a while, contributor lost interest.",
    "Superseded by other PR/discussion.",
    "Replaced by superior solution :- Author closed PR because JAX functionality is a superset of numpy functionality.  JAX shouldn't deprecate features just because NumPy doesn't have them.",
    "Superseded by other changes / alternate approach.",
    "Stale :- PR closed due to inactivity or lack of interest.",
    "Superseded by numpy :- JAX functionality supersedes numpy, no need to deprecate existing implementation.",
    "JAX package has evolved significantly, making the PR outdated.",
    "PR closed as implementation considered correct and valuable, but numpy compatibility desired.",
    "Rejected :- PR intends to deprecate existing behavior which was deemed valuable.",
    "Inconclusive :- PR closed due to differing opinions about desired behavior.",
    "Incompatible/Erroneous: PR deprecated functionality that was deemed valuable.  It broke existing behavior without sufficient justification.",
    "Here's a 10-word summary for each PR closure reason:\n\n**PR 2210:** Implemented array literals in jaxprs, fixing pmap constant broadcasting.\n\n**PR 25802:** Incorrect `custom_partitioning` usage; solution provided, PR closed.\n\n**PR 25143:**  PR abandoned as deviceless AOT functionality already working.\n\n**PR 25107:**  Closed due to misunderstanding of reviewer's requested changes.\n\n**PR 24438:** Workaround obsolete; CUDA update fixed underlying ptxas bug.\n\n**PR 24203:**  Closed; removing complex dtype support deemed unnecessary.",
    "Functionality mismatch with numpy resolved in JAX.",
    "Implemented :- PR closed after successful implementation.",
    "Stale, Redundant, Miscommunication, Outdated, Erroneous",
    "Closed as not useful/inconsistent with project goals.",
    "Superseded by NumPy :- PR tries to match NumPy behavior but JAX is a superset of NumPy so matching is not needed.",
    "Incorrect behavior :- PR tries to remove support for complex dtypes.",
    "Author withdrew PR because it was not needed or useful.",
    "Stale :- PR abandoned due to staleness.",
    "Inconsistent behavior change; reverted to maintain superset functionality.",
    "Implemented :- PR implemented the intended feature/bug fix.",
    "Here's a 10-word summary for each closure reason:\n\n* **PR 1803:**  Closed due to newer design direction from collaborator.\n* **PR 25802:** Rejected: solution exposes internal APIs, better alternative exists.\n* **PR 25143:** Abandoned: original issue resolved by other means.\n* **PR 25107:** Closed: miscommunication between author and reviewer on changes.\n* **PR 24438:** Closed: addressed by external dependency update.\n* **PR 24203:** Rejected: removes functionality, breaks compatibility without benefit.",
    "PR closed as the proposed change was deemed unnecessary and potentially harmful to existing users.",
    "Alternative approach chosen, deemed unnecessary, superseded by other changes, incorrect implementation, changed requirements.",
    "Deprecated behavior :- PR deprecates a useful feature.",
    "CLA issue resolved, closed as obsolete, contributor misunderstanding, bug fix superseded, functionality deprecation.",
    "Code incompatibility :- PR introduced breaking changes that are undesirable.",
    "Superseded by NumPy :- JAX's functionality supersedes that of NumPy; NumPy raising TypeError doesn't necessitate JAX to follow suit.",
    "Superseded by another PR/implementation.",
    "Stale; addressed differently; redundant; miscommunication; outdated; erroneous.",
    "Superseded by other solutions.\nInconsistent with numpy.\nResolved by dependency update.\nDeprecated a working feature.\nMisunderstood reviewer's feedback.\nAbandoned due to staleness.\nRedundant; issue auto-resolved.\nExposes internal APIs.\nNo longer necessary.\nClosed by author.",
    "PR closed as implemented functionality was deemed unnecessary and potentially harmful.",
    "Suboptimal change, superseded by other solutions or dependency updates.  Incorrect approach, rejected due to incompatibility or exposing internals.  Abandoned due to redundancy with existing implementation.  Closed due to miscommunication with reviewers. Feature considered unnecessary, breaking change.",
    "Rejected :- Functionality deemed valuable and shouldn't be removed.",
    "Intended behavior change deprecated by core developers.",
    "Implemented :- PR closed after requested changes were made and approved.",
    "Inconsistent behavior fixed: PR closed as JAX shouldn't deprecate existing, functional behavior.",
    "Inconsistent with numpy"
]